#!/bin/bash
# Цей сценарій обчислює прості відсотки, враховуючи основну суму,
# річну процентну ставку та період часу в роках.

# Не використовуйте це в продуктивному середовищі. Тільки для демонстраційних цілей.

# Автор: Upkar Lidder (IBM)
# Додаткові автори:
# Bohdan

# Вхідні дані:
# p, основна сума
# t, період часу в роках
# r, річна процентна ставка

# Вихідні дані:
# прості відсотки = p*t*r

echo "Введіть основну суму:"
read p
echo "Введіть період часу в роках:"
read t
echo "Введіть процентну ставку за рік:"
read r

s=$(echo "scale=2; $p * $t * $r / 100" | bc)
echo "Прості відсотки становлять: "
echo $s
